In [1]:
%pip install pandas

Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.13/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
# Series() -> one dimensional array -object (like column in a table)
data = [100,200,300,400,500,600,700]
s = pd.Series(data)
print(s)

0    100
1    200
2    300
3    400
4    500
5    600
6    700
dtype: int64

In [4]:
# custom index ...
index_custom = ['a','b','c','d','e','f','g']
s = pd.Series(data,index=index_custom)
print(s)

a    100
b    200
c    300
d    400
e    500
f    600
g    700
dtype: int64

In [6]:
# access data from index
# print(s[4])
print(s['e'])

500

In [7]:
# DataFrame() -> two dimensional table (Excel sheet) with row , column

# dataset as a dictionary -> (key -> column Name)
data = {
    'Name':['nishant','Prasad','pooja','arya','joy'],
    'Age':[23,12,14,15,20],
    'City':['Mumbai','Surat','Jaipur','Chicago','Houston']
}

df = pd.DataFrame(data)
print(df)

      Name  Age     City
0  nishant   23   Mumbai
1   Prasad   12    Surat
2    pooja   14   Jaipur
3     arya   15  Chicago
4      joy   20  Houston

In [8]:
# access column 
df['Name']

0    nishant
1     Prasad
2      pooja
3       arya
4        joy
Name: Name, dtype: object

In [9]:
# acess data from csv file 
df = pd.read_csv("dataset/customer_info.csv")
print(df)
# pd.read_excel("path/..")

     Customer_ID  Age  Gender Account_Status
0              1   66    Male       Inactive
1              2   53  Female      Suspended
2              3   40  Female      Suspended
3              4   49   Other       Inactive
4              5   27   Other      Suspended
..           ...  ...     ...            ...
295          296   69  Female      Suspended
296          297   45  Female         Active
297          298   27  Female       Inactive
298          299   55  Female       Inactive
299          300   64    Male       Inactive

[300 rows x 4 columns]

In [10]:
# show only first 5 row
df.head()

   Customer_ID  Age  Gender Account_Status
0            1   66    Male       Inactive
1            2   53  Female      Suspended
2            3   40  Female      Suspended
3            4   49   Other       Inactive
4            5   27   Other      Suspended

In [11]:
# show only first 10 row
df.head(10)

   Customer_ID  Age  Gender Account_Status
0            1   66    Male       Inactive
1            2   53  Female      Suspended
2            3   40  Female      Suspended
3            4   49   Other       Inactive
4            5   27   Other      Suspended
5            6   28  Female         Active
6            7   55  Female         Active
7            8   23    Male       Inactive
8            9   58  Female       Inactive
9           10   64  Female       Inactive

In [13]:
df['Age'].head(10) # access single column

0    66
1    53
2    40
3    49
4    27
5    28
6    55
7    23
8    58
9    64
Name: Age, dtype: int64

In [15]:
# access multiple column  top 10
df[['Age','Account_Status']].head(10)

   Age Account_Status
0   66       Inactive
1   53      Suspended
2   40      Suspended
3   49       Inactive
4   27      Suspended
5   28         Active
6   55         Active
7   23       Inactive
8   58       Inactive
9   64       Inactive

In [16]:
# find row and column number 
df.shape

(300, 4)

In [17]:
# find all info -> datatype, non-null counts
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Customer_ID     300 non-null    int64
 1   Age             300 non-null    int64
 2   Gender          300 non-null    object
 3   Account_Status  300 non-null    object
dtypes: int64(2), object(2)
memory usage: 9.5+ KB

In [18]:
# symmary stats for numeric columns 
df.describe()

       Customer_ID         Age
count   300.000000  300.000000
mean    150.500000   42.113333
std      86.746758   14.807138
min       1.000000   18.000000
25%      75.750000   29.000000
50%     150.500000   41.000000
75%     225.250000   54.250000
max     300.000000   69.000000

In [19]:
# print all columns name
df.columns.tolist()

['Customer_ID', 'Age', 'Gender', 'Account_Status']

In [21]:
# access single column 
print(df['Gender'].head())

0      Male
1    Female
2    Female
3     Other
4     Other
Name: Gender, dtype: object

In [25]:
# first to row using -> iloc[start_row:end_row]
print(df.iloc[100:110])

     Customer_ID  Age  Gender Account_Status
100          101   24  Female      Suspended
101          102   55   Other         Active
102          103   25  Female       Inactive
103          104   30   Other       Inactive
104          105   54   Other         Active
105          106   19    Male         Active
106          107   58    Male      Suspended
107          108   28   Other      Suspended
108          109   41    Male         Active
109          110   23   Other      Suspended

In [32]:
# filtering data
filter_age = df[df['Age'] > 60]
print(filter_age.head(10))

    Customer_ID  Age  Gender Account_Status
0             1   66    Male       Inactive
9            10   64  Female       Inactive
22           23   68  Female         Active
24           25   64    Male      Suspended
28           29   65  Female      Suspended
30           31   69    Male       Inactive
31           32   65  Female       Inactive
34           35   66  Female      Suspended
35           36   66    Male         Active
37           38   62   Other       Inactive

In [33]:
filter_age = df[(df['Age'] > 60) & (df['Gender'] == 'Male')]
print(filter_age)

     Customer_ID  Age Gender Account_Status
0              1   66   Male       Inactive
24            25   64   Male      Suspended
30            31   69   Male       Inactive
35            36   66   Male         Active
40            41   63   Male         Active
46            47   69   Male       Inactive
152          153   63   Male         Active
179          180   63   Male       Inactive
199          200   66   Male         Active
210          211   64   Male         Active
219          220   61   Male       Inactive
224          225   66   Male       Inactive
245          246   67   Male      Suspended
253          254   68   Male       Inactive
299          300   64   Male       Inactive

In [34]:
# dataset as a dictionary -> (key -> column Name)
data = {
    'Name':['nishant','Prasad','pooja','arya','joy'],
    'Age':[23,12,14,15,20],
    'City':['Mumbai','Surat','Jaipur','Chicago','Houston']
}

df = pd.DataFrame(data)
print(df)

      Name  Age     City
0  nishant   23   Mumbai
1   Prasad   12    Surat
2    pooja   14   Jaipur
3     arya   15  Chicago
4      joy   20  Houston

In [35]:
# add new column 
df['Salary'] = [20000,34000,450000,67000,870000]
print(df)

      Name  Age     City  Salary
0  nishant   23   Mumbai   20000
1   Prasad   12    Surat   34000
2    pooja   14   Jaipur  450000
3     arya   15  Chicago   67000
4      joy   20  Houston  870000

In [36]:
# assign() 
df = df.assign(Bonus = [300,400,600,578,900])
print(df)

      Name  Age     City  Salary  Bonus
0  nishant   23   Mumbai   20000    300
1   Prasad   12    Surat   34000    400
2    pooja   14   Jaipur  450000    600
3     arya   15  Chicago   67000    578
4      joy   20  Houston  870000    900

In [38]:
# add column with same value for all row
df['NewCountry'] = 'USA'
print(df)

      Name  Age     City  Salary  Bonus NewCountry
0  nishant   23   Mumbai   20000    300        USA
1   Prasad   12    Surat   34000    400        USA
2    pooja   14   Jaipur  450000    600        USA
3     arya   15  Chicago   67000    578        USA
4      joy   20  Houston  870000    900        USA

In [39]:
# add new column based on calculation
df['total_amounts'] = df['Salary']+df['Bonus']
print(df)

      Name  Age     City  Salary  Bonus NewCountry  total_amounts
0  nishant   23   Mumbai   20000    300        USA          20300
1   Prasad   12    Surat   34000    400        USA          34400
2    pooja   14   Jaipur  450000    600        USA         450600
3     arya   15  Chicago   67000    578        USA          67578
4      joy   20  Houston  870000    900        USA         870900

In [40]:
# update existing values 
df.loc[2,'Age'] = 32
print(df)

      Name  Age     City  Salary  Bonus NewCountry  total_amounts
0  nishant   23   Mumbai   20000    300        USA          20300
1   Prasad   12    Surat   34000    400        USA          34400
2    pooja   32   Jaipur  450000    600        USA         450600
3     arya   15  Chicago   67000    578        USA          67578
4      joy   20  Houston  870000    900        USA         870900

In [41]:
# multiple value in one column 
df.loc[2:3,'Salary'] = [75000,85000] 
print(df)

      Name  Age     City  Salary  Bonus NewCountry  total_amounts
0  nishant   23   Mumbai   20000    300        USA          20300
1   Prasad   12    Surat   34000    400        USA          34400
2    pooja   32   Jaipur   75000    600        USA         450600
3     arya   15  Chicago   85000    578        USA          67578
4      joy   20  Houston  870000    900        USA         870900

In [42]:
# update using condition 
df.loc[df['Salary'] > 50000,'Senior'] = 'Yes'
df.loc[df['Salary'] <= 50000,'Senior'] = 'No'
print(df)

      Name  Age     City  Salary  Bonus NewCountry  total_amounts Senior
0  nishant   23   Mumbai   20000    300        USA          20300     No
1   Prasad   12    Surat   34000    400        USA          34400     No
2    pooja   32   Jaipur   75000    600        USA         450600    Yes
3     arya   15  Chicago   85000    578        USA          67578    Yes
4      joy   20  Houston  870000    900        USA         870900    Yes

In [43]:
# dropping Columns and row
# drop column
df_col_drop = df.drop('City',axis=1)
print(df_col_drop)

      Name  Age  Salary  Bonus NewCountry  total_amounts Senior
0  nishant   23   20000    300        USA          20300     No
1   Prasad   12   34000    400        USA          34400     No
2    pooja   32   75000    600        USA         450600    Yes
3     arya   15   85000    578        USA          67578    Yes
4      joy   20  870000    900        USA         870900    Yes

In [44]:
# multiple drop column 
df_new = df.drop(['Bonus','total_amounts'],axis=1)
print(df_new)

      Name  Age     City  Salary NewCountry Senior
0  nishant   23   Mumbai   20000        USA     No
1   Prasad   12    Surat   34000        USA     No
2    pooja   32   Jaipur   75000        USA    Yes
3     arya   15  Chicago   85000        USA    Yes
4      joy   20  Houston  870000        USA    Yes

In [45]:
# delete row multiple
df_clean = df.drop([0,3])
print(df_clean)

     Name  Age     City  Salary  Bonus NewCountry  total_amounts Senior
1  Prasad   12    Surat   34000    400        USA          34400     No
2   pooja   32   Jaipur   75000    600        USA         450600    Yes
4     joy   20  Houston  870000    900        USA         870900    Yes

In [46]:
# delete single row
df_clean = df.drop(2)
print(df_clean)

      Name  Age     City  Salary  Bonus NewCountry  total_amounts Senior
0  nishant   23   Mumbai   20000    300        USA          20300     No
1   Prasad   12    Surat   34000    400        USA          34400     No
3     arya   15  Chicago   85000    578        USA          67578    Yes
4      joy   20  Houston  870000    900        USA         870900    Yes